W12D3/bench_BnB/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "alexalex"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = User.find_by(username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "FDH0Xb6m19rfl8wXbF8bHQ"], ["updated_at", "2022-07-07 16:52:10.992232"], ["id", 6]]
---
    def reset_session_token
        self.session_token = SecureRandom.urlsafe_base64
        self.save