W6D4/first_routers_and_controllers/app/controllers/artworks_controller.rb

    def index
        if params[:user_id]
            render json: Artwork.get_user_artwork(params[:user_id])
        else
            @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def show
        @artwork = Artwork.find_by id: params[:id]
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update
        @artwork = Artwork.find_by id: params[:id]
        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "full color landscape"], ["updated_at", "2022-05-26 22:13:27.615880"], ["id", 5]]

    def destroy
        @artwork = Artwork.find_by id: params[:id]
        @artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]