W7D5/reddit_clone/app/controllers/subs_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @user = User.find_by(id: params[:user_id])