W7D3/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Red Hot Chili Peppers"], ["created_at", "2022-06-02 04:05:38.715644"], ["updated_at", "2022-06-02 04:05:38.715644"]]
---
    def create
        @band = Band.new(bands_params)
        if @band.save